// TODO: Определите новый тип `SaturatingU16`.
//   Он должен хранить значение `u16`.
//   Он должен поддерживать преобразования из `u16`, `u8`, `&u16` и `&u8`.
//   Он должен поддерживать сложение с правой частью типа
//   SaturatingU16, u16, &u16 и &SaturatingU16. Сложение должно насыщаться на
//   максимальном значении `u16`.
//   Должна быть возможность сравнивать его с другим `SaturatingU16` или с `u16`.
//   Должна быть возможность вывести его отладочное представление.
//
// Тесты находятся в папке `tests` — обратите внимание на видимость типов и методов.
